#include <stdio.h>
#include <math.h>

int main(void)
{
    int WIDTH = 120;  // Ширина консольного вікна
    int HEIGHT = 30;  // Висота консольного вікна
    
    for (int y = 0; y < HEIGHT; y++)
    {
        for (int x = 0; x < WIDTH; x++)
        {
            double xf = (x - WIDTH / 2.0) / (WIDTH / 10.0);  // Перетворення координати x відносно центру вікна
            double yf = (y - HEIGHT / 2.0) / (HEIGHT / 2.0);  // Перетворення координати y відносно центру вікна
            double value = cbrt(pow(xf, 3)) * sin(xf);  // Обчислення значення функції для координати xf
            
            // Порівнюємо значення функції з поточною позицією на графіку
            if (yf >= value - 0.05 && yf <= value + 0.05)
            {
                printf("*");  // Вивести "*" як піксель графіку, якщо умова виконується
            }
            else
            {
                printf(" ");  // Вивести пробіл, якщо умова не виконується
            }
        }
        printf("\n");  // Перехід до наступного рядка графіку
    }

    return 0;
}
